 //****************************  
 //  Copyright£ºPERFECT WORLD  
 //  Modified£º2013.2.25  
 //  Author£º²Ü³þÉ`  
 //  TaskName£º ³õÁÙÖ®°×ÑòÊ¹Õß 
 //****************************  
function OnDead(){ 

//9347	°×Ñò1	90266
//9348	°×Ñò2-Ö÷	90267
//9349	°×Ñò2-¸¨	90268
//9350	°×Ñò3-Ö÷	90269
//9351	°×Ñò3-¸¨	90270

//--------------µôÂä¿ªÊ¼------------------------------
//--µôÂä°ü 
	$playerID = GetPlayerID()
		if $playerID < 0
			return
		endif
//------------------------------------------
    $dropitemD1 = 90266
		//$droped = 0
		//$droped2 = 0
		DropMonsterItems($playerID,$dropitemD1)
		
		 
//----------------------µôÂä½áÊø--------------------	
	}